app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "description", "priority", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 18 May 2012 20:52:50 UTC +00:00], ["description", "Aasdf as d fa sd fasdfa sdf asd  wiiiii"], ["priority", 29], ["updated_at", Fri, 18 May 2012 20:52:50 UTC +00:00]]
---
  def create
  	@task = Task.new(params[:task])
  	if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
  	Task.find(params[:id]).try(:delete)